{
    "posts": [
      {
        "id": 1,
        "title": "South Island, New Zealand",
        "authorId":"1",
        "author":"L. Gulliver",
        "body":"New Zealand's South Island brims with majestic landscapes at every turn, from dramatic mountains to fjords to glaciers. Here, you can admire the mountains of Fiordland National Park, a UNESCO World Heritage Site, from hiking trails or a boat on Milford Sound. At night, journey to the University of Canterbury's Mount John Observatory to gaze at the starry skies. You can also indulge your inner daredevil in Queenstown, explore two of the most accessible glaciers in the world on the island's west coast or sample delicious food and wine in the Marlborough region.",
        "image":"https://travel.usnews.com/dims4/USNEWS/a798492/2147483647/resize/445x280%5E%3E/crop/445x280/quality/85/?url=https://travel.usnews.com/images/edited_south_island_nz_getty_irma_ferreira_445x280_dxgXWlc.jpg"
      },
      {
        "id": 2,
        "title": "Paris",
        "authorId":"1",
        "author":"L. Gulliver",
        "body":"The magnetic City of Light draws visitors from around the globe who come to see iconic attractions like the Eiffel Tower, the Louvre and the Arc de Triomphe. But what travelers really fall in love with are the city's quaint cafes, vibrant markets, trendy shopping districts and unmistakable je ne sais quoi charm. Get lost wandering along Paris' cobblestone streets, or grab a croissant and relax on the banks of the Seine for hours. If you're up for a quick daytrip, head about 15 miles southwest of the city center to another must-see attraction: the Palace of Versailles.",
        "image":"https://travel.usnews.com/dims4/USNEWS/c5a8f6d/2147483647/resize/445x280%5E%3E/crop/445x280/quality/85/?url=https://travel.usnews.com/images/gettyimages-532590277_2ZNe4ra.jpg"
      },
      {
        "id": 3,
        "title": "Bora Bora",
        "authorId":"2",
        "author":"Mona Corona",
        "body":"What this small French Polynesian island may lack in size it makes up for in sheer tropical beauty. Here, you'll find picturesque beaches, lush jungles and luxurious resorts. The island's dormant volcano, Mount Otemanu, makes for a great photo-op or challenging hike, and the friendly Bora Bora locals can help you catch a glimpse of the island's best sights during an off-road excursion. To relax, head to Matira Beach for crystal-clear water and soft sand. Although a trip to Bora Bora is very expensive, most travelers say it's worth every penny.",
        "image":"https://travel.usnews.com/dims4/USNEWS/472cf27/2147483647/resize/445x280%5E%3E/crop/445x280/quality/85/?url=https://travel.usnews.com/images/borabora_445x280_dtTOVY1.jpg"
      },
      {
        "id": 4,
        "title": "Maui",
        "authorId":"2",
        "author":"Mona Corona",
        "body":"Whether you're driving along the Road to Hana, enjoying a bird's-eye view of the lush coastline from a helicopter, snorkeling with sea turtles or simply relaxing on the Hawaiian island's honey- or black-colored beaches, you'll find that Maui is unlike any other tropical destination. Don't miss a chance to visit Haleakala National Park, which is home to the world's largest dormant volcano. You should also attend a luau for a dose of local culture and a taste of Hawaiian specialties like poi, poke and mahimahi.",
        "image":"https://travel.usnews.com/dims4/USNEWS/070489a/2147483647/resize/445x280%5E%3E/crop/445x280/quality/85/?url=https://travel.usnews.com/images/GettyImages-117211856_TeGITRy.jpg"
      }
    ],
    "comments": [
      {
        "id": 1,
        "body": "I enjoyed reading your article about New Zealand!",
        "name":"Larry Lin",
        "email":"larrylin@gmail.com",
        "postId": 1
      },
      {
        "id": 2,
        "body": "When is the best time to visit?",
        "name":"Ava Wright",
        "email":"avawright@gmail.com",
        "postId": 1
      },
      {
        "id": 3,
        "body": "I can't wait to go!",
        "name":"Ava Wright",
        "email":"avawright@gmail.com",
        "postId": 2
      },
        {
        "id": 4,
        "body": "Are there any budget friendly hotels there?",
        "name":"Noah Walker",
        "email":"noahwalker@gmail.com",
        "postId": 3
      },
      {
        "id": 5,
        "body": "Tres Bien!",
        "name":"Glen Rouse",
        "email":"glenrouse@gmail.com",
        "postId": 2
      },
      {
        "id": 6,
        "body": "Bringing back memories of my last trip there! Beautiful place!",
        "name":"Vera Hare",
        "email":"verahare@gmail.com",
        "postId": 3
      },
      {
        "id": 7,
        "body": "Which hotel do you recommend in Maui?",
        "name":"Oliver Patrick",
        "email":"oliverpatrick@gmail.com",
        "postId": 4
      } ,
      {
       "id": 8,
      "body": "Isn't this where they filmed The Lord of the Rings?",
      "name":"Harry Dean",
      "email":"harrydean@gmail.com",
      "postId": 1
    },
    {
      "id": 9,
      "body": "Amazing destination!",
      "name":"Hollie Joe",
      "email":"holliejoe@gmail.com",
      "postId": 1
    },
    {
      "id": 10,
      "body": "Bringin my kids there this coming spring break",
      "name":"Danny Beck",
      "email":"dannybeck@gmail.com",
      "postId": 2
    },
      {
      "id": 11,
      "body": "I can't wait to see enjoy Bora Bora!",
      "name":"Neil Lane",
      "email":"neillane@gmail.com",
      "postId": 3
    },
    {
      "id": 12,
      "body": "Are there any day passes that we could purchase? Trying to stay on budget.",
      "name":"Owen Hart",
      "email":"ownehart@gmail.com",
      "postId": 2
    },
    {
      "id": 13,
      "body": "Someday I'll visit this place.",
      "name":"Macy Vaughn",
      "email":"macyvaughn@gmail.com",
      "postId": 3
    },
    {
      "id": 14,
      "body": "Family friendly indeed.",
      "name":"Harry Stone",
      "email":"harrystone@gmail.com",
      "postId": 4
    }
    ]
  }